Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: Exception state is maintained in per-thread storage (this is equivalent to using global storage in an unthreaded application). A thread can be in one of two states: an exception has occurred, or not. The function :cfunc:`PyErr_Occurred` can be used to check for this: it returns a borrowed reference to the exception type object when an exception has occurred, and *NULL* otherwise. There are a number of functions to set the exception state: :cfunc:`PyErr_SetString` is the most common (though not the most general) function to set the exception state, and :cfunc:`PyErr_Clear` clears the exception state.
pl: Stan wyjątku jest utrzymywany w przestrzeni przydzielonej wątkowi (jest to równoważne użyciu nadrzędnego miejsca przechowania w programie pozbawionym wątków). Wątek może być w jednym z dwu stanów: gdy wyjątek nastąpił, lub nie. Zadanie :cfunc:`PyErr_Occurred` może być użyty aby to sprawdzić: zwraca on pożyczone odniesienie do przedmiotu rodzaju błędu gdy sytuacja wyjątkowa nastąpiła, i *NULL* w przeciwnym razie. Istnieje parę zadań ustawiających stan wyjątku: :cfunc:`PyErr_SetString` jest najczęstszym (chociaż nie najogólniejszym) zadaniem ustalającym stan wyjątku, a zadanie :cfunc:`PyErr_Clear` czyści stan wyjątku.

source: The full exception state consists of three objects (all of which can be *NULL*): the exception type, the corresponding exception value, and the traceback. These have the same meanings as the Python result of ``sys.exc_info()``; however, they are not the same: the Python objects represent the last exception being handled by a Python :keyword:`try` ... :keyword:`except` statement, while the C level exception state only exists while an exception is being passed on between C functions until it reaches the Python bytecode interpreter's main loop, which takes care of transferring it to ``sys.exc_info()`` and friends.
pl: Pełen stan wyjątku obejmuje trzy przedmioty (z których wszystkie mogą być *NULL*): rodzaj wyjątku, odpowiadająca mu wartość wyjątku, i przebieg wykonania. Te mają te same znaczenia, jak wynik wywołania ``sys.exc_info()``; jednakże nie są one tożsame: przedmioty języka pytonowskiego reprezentują ostatni wyjątek obsłużone przez wyrażenie języka pytonowskiego :keyword:`try` ... :keyword:`except`, podczas gdy stan wyjątku poziomu języka C istnieje tylko podczas przekazywania wyjątku pomiędzy zadaniami języka C dopóki nie natrafi na kod kęsowy głównej pętli programu interpretującego polecenia języka pytonowskiego, który zajmuje się przenoszeniem wyjątku do ``sys.exc_info()`` i zaprzyjaźnionych.

source: Note that starting with Python 1.5, the preferred, thread-safe way to access the exception state from Python code is to call the function :func:`sys.exc_info`, which returns the per-thread exception state for Python code. Also, the semantics of both ways to access the exception state have changed so that a function which catches an exception will save and restore its thread's exception state so as to preserve the exception state of its caller. This prevents common bugs in exception handling code caused by an innocent-looking function overwriting the exception being handled; it also reduces the often unwanted lifetime extension for objects that are referenced by the stack frames in the traceback.
pl: Zauważ że poczynając od języka pytonowskiego w wersji 1.5 preferowaną, bezpiecznym dla wątków sposobem na dostęp do stanu wyjątku z poziomu kodu napisanego w języku pytonowskim jest wezwanie zadania :func:`sys.exc_info`, które zwraca określony-dla-wątku stan wyjątku dla kodu napisanego w języku pytonowskim. Poza tym składnia obu sposobów na dostęp do stanu sytuacji wyjątkowej zmieniła się tak, że zadanie które złapie wyjątek zachowa i przywróci swój stan wyjątku tak, aby zachować stan wyjątku wywołujacego zadanie. To działanie zapobiega typowym błędom w obsłudze sytuacji wyjątkowych powodowanych przez niewinnie-wyglądające zadania nadpisujące sytuacje wyjątkowe które aktualnie są obsługiwane; to także redukuje często niechciane wydłużanie czasu życia przedmiotów do których odnosi się ramka stosu w wypisie śladu wywołań.

source: As a general principle, a function that calls another function to perform some task should check whether the called function raised an exception, and if so, pass the exception state on to its caller. It should discard any object references that it owns, and return an error indicator, but it should *not* set another exception --- that would overwrite the exception that was just raised, and lose important information about the exact cause of the error.
pl: Jako nadrzędną zasadę, przyjmuje się że zadanie które wywołuje inne zadanie do wykonania pewnych operacji powinno sprawdzić czy wywołane zadanie zgłosiło wyjątek, a jeśli tak, to przekazać stan wyjątku do wywołującego. Powinno też odrzucić jakiekolwiek odniesienia do przedmiotów, które posiada, i zwrócić sygnalizator błędu, ale nie powinno ustawiać innego wyjątku --- który nadpisywałby wyjątek, który właśnie został zgłoszony i tracić istotne informacje o dokładnym powodzie błędu.

source: A simple example of detecting exceptions and passing them on is shown in the :cfunc:`sum_sequence` example above. It so happens that that example doesn't need to clean up any owned references when it detects an error. The following example function shows some error cleanup. First, to remind you why you like Python, we show the equivalent Python code::
pl: Prosty przykład wykrywania wyjątków i przykazywania ich jest pokazany w powyższym przykładzie :cfunc:`suma_sekwencji`. Tak się składa że w tym przykładzie nie ma potrzeby czyszczenia żadnych posiadanych odniesień gdy wykryje błąd. Następujące przykładowe zadanie pokazuje pewne sprzątanie po błędach. Wpierw, aby przypomnieć dlaczego lubić można język pytonowski, pokazujemy odpowiadający kod w języku pytonowskim::

source: def incr_item(dict, key): try: item = dict[key] except KeyError: item = 0 dict[key] = item + 1
pl: def zwieksz_element(slownik, klucz): try: element = slownik[klucz] except KeyError: element = 0 slownik[klucz] = element + 1

source: Here is the corresponding C code, in all its glory::
pl: Tu następuje odpowiadający kod w języku C, w całej pełni okazałości::

source: int incr_item(PyObject *dict, PyObject *key) { /* Objects all initialized to NULL for Py_XDECREF */ PyObject *item = NULL, *const_one = NULL, *incremented_item = NULL; int rv = -1; /* Return value initialized to -1 (failure) */ item = PyObject_GetItem(dict, key); if (item == NULL) { /* Handle KeyError only: */ if (!PyErr_ExceptionMatches(PyExc_KeyError)) goto error; /* Clear the error and use zero: */ PyErr_Clear(); item = PyLong_FromLong(0L); if (item == NULL) goto error; } const_one = PyLong_FromLong(1L); if (const_one == NULL) goto error; incremented_item = PyNumber_Add(item, const_one); if (incremented_item == NULL) goto error; if (PyObject_SetItem(dict, key, incremented_item) < 0) goto error; rv = 0; /* Success */ /* Continue with cleanup code */ error: /* Cleanup code, shared by success and failure path */ /* Use Py_XDECREF() to ignore NULL references */ Py_XDECREF(item); Py_XDECREF(const_one); Py_XDECREF(incremented_item); return rv; /* -1 for error, 0 for success */ }
pl: int zwieksz_element(PyObject *slownik, PyObject *klucz) { /* Wszystkie przedmioty ustawione pierwotnie na NULL dla Py_XDECREF */ PyObject *element = NULL, *staly_jeden = NULL, *zwiekszany_element = NULL; int wzw = -1; /* Wartość zwracana ustawiona początkowo na -1 (błąd) */ element = PyObject_GetItem(slownik, klucz); if (element == NULL) { /* Obsłuż tylko wyjątek KeyError: */ if (!PyErr_ExceptionMatches(PyExc_KeyError)) goto blad; /* Wytrzyj błąd i użyj zera: */ PyErr_Clear(); element = PyLong_FromLong(0L); if (element == NULL) goto blad; } staly_jeden = PyLong_FromLong(1L); if (staly_jeden == NULL) goto blad; zwiekszany_element = PyNumber_Add(element, staly_jeden); if (zwiekszany_element == NULL) goto blad; if (PyObject_SetItem(slownik, klucz, zwiekszany_element) < 0) goto blad; wzw = 0; /* Sukces */ /* Kontynuuj ze sprzątaniem po kodzie */ blad: /* Sprzątanie, współdzielone przez ścieżki błędu i sukcesu */ /* Używaj Py_XDECREF() aby zignorować NULL odniesienia */ Py_XDECREF(element); Py_XDECREF(staly_jeden); Py_XDECREF(zwiekszany_element); return wzw; /* -1 dla błędu, 0 for sukcesu */ }

source: This example represents an endorsed use of the ``goto`` statement in C! It illustrates the use of :cfunc:`PyErr_ExceptionMatches` and :cfunc:`PyErr_Clear` to handle specific exceptions, and the use of :cfunc:`Py_XDECREF` to dispose of owned references that may be *NULL* (note the ``'X'`` in the name; :cfunc:`Py_DECREF` would crash when confronted with a *NULL* reference). It is important that the variables used to hold owned references are initialized to *NULL* for this to work; likewise, the proposed return value is initialized to ``-1`` (failure) and only set to success after the final call made is successful.
pl: Ten przykład pokazuje przyjęte użycie wyrażenia idzdo - z ang. - ``goto`` w C! Pokazuje ono użycie :cfunc:`PyErr_ExceptionMatches` i :cfunc:`PyErr_Clear` do obsługi szczególnych wyjątków, i użycie :cfunc:`Py_XDECREF` do posprzątania po posiadanych odniesieniach, które mogą być *NULL* (zwróć uwagę na ``'X'`` w nazwie; :cfunc:`Py_DECREF wyłożyłby się w konfrontacji z *pustym* - *NULL* odniesieniem). Jest istotne, że zmienne użyte do trzymania własnych odniesień są zainicjowane *NULL* aby mogło to zadziałać; podobnie, proponowana wartość zwracana jest inicjowana na ``-1`` (błąd) i ustawiana na sukces tylko gdy ostatnie wywołanie zakończy się sukcesem.

source: Embedding Python
pl: Załączanie programu interpretującego język pytonowski

source: The one important task that only embedders (as opposed to extension writers) of the Python interpreter have to worry about is the initialization, and possibly the finalization, of the Python interpreter. Most functionality of the interpreter can only be used after the interpreter has been initialized.
pl: Jedno istotne zadanie, o które załączający (w przeciwieństwie do piszących rozszerzenia) program interpretujący język pytonowski muszą się martwić jest zainicjowanie i prawdopodobne zakończenie programu interpretującego polecenia języka pytonowskiego. Większość użyteczności programu interpretującego polecenia języka pytonowskiego może tylko być użyta po jego zainicjowaniu.

source: The basic initialization function is :cfunc:`Py_Initialize`. This initializes the table of loaded modules, and creates the fundamental modules :mod:`builtins`, :mod:`__main__`, :mod:`sys`, and :mod:`exceptions`. It also initializes the module search path (``sys.path``).
pl: podstawowym poleceniem inicjującym jest :cfunc:`Py_Initialize`. To inicjuje tabelę załadowanych modułów, i tworzy podstawowe moduły wbudowane - :mod:`builtins`, nadrzędny - :mod:`__main__`, i systemowy - :mod:`sys`, i moduł wyjątków - :mod:`exceptions`. Inicjuje także ścieżkę poszukiwania modułów - (``sys.path``).

source: :cfunc:`Py_Initialize` does not set the "script argument list" (``sys.argv``). If this variable is needed by Python code that will be executed later, it must be set explicitly with a call to ``PySys_SetArgvEx(argc, argv, updatepath)`` after the call to :cfunc:`Py_Initialize`.
pl: :cfunc:`Py_Initialize` nie ustawia "listy parametrów skryptu" (``sys.argv``). Jeśli ta zmienna jest wymagana przez kod języka pytonowskiego który ma być wykonany później, musi być ustalony jawnie przez wywołanie ``PySys_SetArgvEx(argc, argv, updatepath)`` po odwołaniu do :cfunc:`Py_Initialize`.

source: On most systems (in particular, on Unix and Windows, although the details are slightly different), :cfunc:`Py_Initialize` calculates the module search path based upon its best guess for the location of the standard Python interpreter executable, assuming that the Python library is found in a fixed location relative to the Python interpreter executable. In particular, it looks for a directory named :file:`lib/python{X.Y}` relative to the parent directory where the executable named :file:`python` is found on the shell command search path (the environment variable :envvar:`PATH`).
pl: Na większości systemów (w szczególności w Unixie i Windowsie, chociaż szczegóły są w niewielkim stopniu różne), zadanie :cfunc:`Py_Initialize` oblicza ścieżkę poszukiwania modułów w oparciu o najlepsze zgadywanie dla położenia najlepszego pliku wykonywalnego programu interpretującego język pytonowski, zakładając że biblioteka języka pytonowskiego znajduje się w ustalonym położeniu względem pliku wykonywalnego programu interpretującego polecenia języka pytonowskiego. W szczególności, poszukuje katalogu nazwanego :file:`lib/python{X.Y}` w odniesieniu do katalogu nadrzędnego gdzie plik wykonywalny nazwany :file:`python` znajduje się na ścieżce poszukiwań poleceń powłoki (w zmiennej środowiskowej :envvar:`PATH`).

source: For instance, if the Python executable is found in :file:`/usr/local/bin/python`, it will assume that the libraries are in :file:`/usr/local/lib/python{X.Y}`. (In fact, this particular path is also the "fallback" location, used when no executable file named :file:`python` is found along :envvar:`PATH`.) The user can override this behavior by setting the environment variable :envvar:`PYTHONHOME`, or insert additional directories in front of the standard path by setting :envvar:`PYTHONPATH`.
pl: Na przykład, jeśli plik wykonywalny programu interpretującego polecenia języka pytonowskiego znajduje się w katalogu :file:`/usr/local/bin/python`, będzie zakładał, że biblioteki są w katalogu :file:`/usr/local/lib/python{X.Y}` (Faktycznie, ta szczególna ścieżka jest także "ratunkowym" położeniem, używanym gdy żaden plik wykonywalny nazwany :file:`python` nie znajdzie się w katalogach znajdujących się w zmiennej środowiskowej :envvar:`PATH`.) Użytkownik może podmienić to zachowanie przez ustawienie zmiennej środowiskowej :envvar:`PYTHONHOME`, lub wstawić dodatkowe katalogi przed sztandarową ścieżką przez ustawienie zmiennej środowiskowej :envvar:`PYTHONPATH`.

source: The embedding application can steer the search by calling ``Py_SetProgramName(file)`` *before* calling :cfunc:`Py_Initialize`. Note that :envvar:`PYTHONHOME` still overrides this and :envvar:`PYTHONPATH` is still inserted in front of the standard path. An application that requires total control has to provide its own implementation of :cfunc:`Py_GetPath`, :cfunc:`Py_GetPrefix`, :cfunc:`Py_GetExecPrefix`, and :cfunc:`Py_GetProgramFullPath` (all defined in :file:`Modules/getpath.c`).
pl: Załącczająca aplikacja może wysterować ścieżkę poszukiwania przez wywołanie ``Py_SetProgramName(file)`` *przed* wywołaniem :cfunc:`Py_Initialize`. Zauważ że ścieżka :envvar:`PYTHONHOME` wciąż wyprzedza to ustalenie zaś :envvar:`PYTHONPATH` wciąż jest wstawiane przed standardową ścieżką dostępu. Aplikacja która wymaga całkowitej kontroli potrzebowałaby swojej własnej interpretacji zadań :cfunc:`Py_GetPath`, :cfunc:`Py_GetPrefix`, :cfunc:`Py_GetExecPrefix`, i :cfunc:`Py_GetProgramFullPath` (wszystkie zdefiniowane w pliku :file:`Modules/getpath.c`).

source: Sometimes, it is desirable to "uninitialize" Python. For instance, the application may want to start over (make another call to :cfunc:`Py_Initialize`) or the application is simply done with its use of Python and wants to free memory allocated by Python. This can be accomplished by calling :cfunc:`Py_Finalize`. The function :cfunc:`Py_IsInitialized` returns true if Python is currently in the initialized state. More information about these functions is given in a later chapter. Notice that :cfunc:`Py_Finalize` does *not* free all memory allocated by the Python interpreter, e.g. memory allocated by extension modules currently cannot be released.
pl: Czasami jest wymagane aby "odinicjować" środowisko języka pytonowskiego. Dla przykładu gdy aplikacja ma potrzebę zrestartować (wykonać jeszcze jedno wywołanie zadania :cfunc:`Py_Initialize`) lub aplikacja jest po prostu zrobiona z użyciem języka pytonowskiego i chciałaby zwolnić pamięć przydzieloną programowi interpretującemu polecenia języka pytonowskiego. Można tego dokonać przez wezwanie :cfunc:`Py_Finalize`. Zadanie :cfunc:`Py_IsInitialized` zwraca prawdę jeśli program wykonujący polecenia języka pytonowskiego jest aktualnie w zainicjowanym stanie. Więcej informacji o tych zadaniach jest dostępna w późniejszym rozdziale. Zauważ, że zadanie :cfunc:`Py_Finalize` *nie* uwalnia całej pamięci przydzielonej przez program interpretujący polecenia języka pytonowskiego, np. pamięci przydzielonej przez moduły rozszerzające aktualnie nie mogą być uwalniane.

source: Debugging Builds
pl: Odpluskwiające Budowy

source: Python can be built with several macros to enable extra checks of the interpreter and extension modules. These checks tend to add a large amount of overhead to the runtime so they are not enabled by default.
pl: Program interpretujący język pytonowski może być zbudowany z kilkoma makropoleceniami do załączenia dodatkowych sprawdzeń programu interpretującego polecenia języka pytonowskiego i modułów rozszerzających. Te sprawdzenia mają zwyczaj dodawać duży narzut czasu wykonania poleceń programu więc nie są załączane domyślnie.

source: A full list of the various types of debugging builds is in the file :file:`Misc/SpecialBuilds.txt` in the Python source distribution. Builds are available that support tracing of reference counts, debugging the memory allocator, or low-level profiling of the main interpreter loop. Only the most frequently-used builds will be described in the remainder of this section.
pl: Pełną listę różnego rodzaju budów odpluskwiania znajduje się w pliku :file:`Misc/SpecialBuilds.txt` w źródłowych zasobach pakietu języka pytonowskiego. Są dostępne budowy ze wsparciem wypisywania przebiegów liczb odniesień, lub profilowania nisko-poziomowego głównej pętli programu interpretującego polecenia języka pytonowskiego. Tylko najczęściej używane budowy będą opisane w dalszej części tej sekcji.

source: Compiling the interpreter with the :cmacro:`Py_DEBUG` macro defined produces what is generally meant by "a debug build" of Python. :cmacro:`Py_DEBUG` is enabled in the Unix build by adding :option:`--with-pydebug` to the :file:`configure` command. It is also implied by the presence of the not-Python-specific :cmacro:`_DEBUG` macro. When :cmacro:`Py_DEBUG` is enabled in the Unix build, compiler optimization is disabled.
pl: Kompilowanie programu interpretującego polecenia języka pytonowskiego z makrodefinicją :cmacro:`Py_DEBUG` określoną daje to co potocznie zwane jest "budową odpluskwiającą" języka pytonowskiego. Makrodefinicja :cmacro:`Py_DEBUG` włączana jest w budowie Unixowej przez dodanie opcji :option:`--with-pydebug` do pliku skryptu :file:`configure` - komendy konfiguracji. Jest to także niejawnie sugerowane przez obecność nie-typowej-dla-języka-pytonowskiego makrodefinicji :cmacro:`_DEBUG`. Gdy makrodefinicja :cmacro:`Py_DEBUG` jest załączona w budowie Unixowej, optymalizacja kompilacji jest wyłączana.

source: In addition to the reference count debugging described below, the following extra checks are performed:
pl: W uzupełnieniu odpluskwiania opartego o zliczanie odniesień opisanego poniżej, następujące dodatkowe sprawdzenia są wykonywane:

source: Extra checks are added to the object allocator.
pl: Dodatkowe sprawdzenia są dodawane do przedmiotu lokującego inne przedmioty w pamięci.

source: Extra checks are added to the parser and compiler.
pl: Dodatkowe sprawdzenia są dodawane do przedmiotu wczytującego i kompilującego.

source: Downcasts from wide types to narrow types are checked for loss of information.
pl: Rzutowania w dół z szerokich do wąskich typów są sprawdzane pod kątem utraty informacji.

source: A number of assertions are added to the dictionary and set implementations. In addition, the set object acquires a :meth:`test_c_api` method.
pl: Pewna ilość ustaleń twierdzących jest dodawana do realizacji słownika i zbioru. W dodatku przedmiot zbioru otrzymuje sposób postępowania zwany pod nazwą :meth:`test_c_api`.

source: Sanity checks of the input arguments are added to frame creation.
pl: Sprawdzenia przytomności parametrów wejściowych dodawane są do kreacji ramki.

source: The storage for ints is initialized with a known invalid pattern to catch reference to uninitialized digits.
pl: Przechowalnia przedmiotów liczb całkowitych z ang. - ints jest inicjowana ze znanym błędnym wzorem do wyłapania odniesień do niezainicjowanych cyfr.

source: Low-level tracing and extra exception checking are added to the runtime virtual machine.
pl: Niskopoziomowe śledzenie i dodatkowe sprawdzanie błędów dodawane jest do kodu wykonywalnego wirtualnej maszyny.

source: Extra checks are added to the memory arena implementation.
pl: Dodatkowe sprawdzenia dodawane są do implementacji areny pamięci.

source: Extra debugging is added to the thread module.
pl: Dodatkowe odpluskwianie dodawane jest do modułu wątków.

source: There may be additional checks not mentioned here.
pl: Mogą istnieć dodatkowe sprawdzenia nie wymienione tutaj.

source: Defining :cmacro:`Py_TRACE_REFS` enables reference tracing. When defined, a circular doubly linked list of active objects is maintained by adding two extra fields to every :ctype:`PyObject`. Total allocations are tracked as well. Upon exit, all existing references are printed. (In interactive mode this happens after every statement run by the interpreter.) Implied by :cmacro:`Py_DEBUG`.
pl: Definiowanie makrodefinicji :cmacro:`Py_TRACE_REFS` włącza śledzenie odniesień. Gdy definicja jest włączona, cykliczna podwójnie powiązana lista aktywnych przedmiotów jest utrzymywana przez dodanie dwóch dodatkowych pól do każdego przedmiotu :ctype:`PyObject`. Suma przydzielonego miejsca jest również śledzona. W momencie wyjścia, wszystkie istniejące odniesienia są wypisywane. (W trybie współpracy człowieka z komputerem to następuje po każdym poleceniu wykonanym przez program interpretujący polecenia języka pytonowskiego.) Dorozumiane po napotkaniu makrodefinicji :cmacro:`Py_DEBUG`.

source: Please refer to :file:`Misc/SpecialBuilds.txt` in the Python source distribution for more detailed information.
pl: Odwołaj się do :file:`Misc/SpecialBuilds.txt` w źródłowym pakiecie języka pytonowskiego po więcej szczegółów.

source: Iterator Protocol
pl: Protokół przedmiotów iterujących.

source: There are only a couple of functions specifically for working with iterators.
pl: Istnieje tylko kilka zadań szczególnie przeznaczonych do pracy z przedmiotami iterującymi.

source: To write a loop which iterates over an iterator, the C code should look something like this::
pl: Aby napisać pętlę iterującą ponad przedmiotem iterującym, kod C powinien wyglądać mniej więcej tak::

source: PyObject *iterator = PyObject_GetIter(obj); PyObject *item; if (iterator == NULL) { /* propagate error */ } while (item = PyIter_Next(iterator)) { /* do something with item */ ... /* release reference when done */ Py_DECREF(item); } Py_DECREF(iterator); if (PyErr_Occurred()) { /* propagate error */ } else { /* continue doing useful work */ }
pl: PyObject *iterator = PyObject_GetIter(przedm); PyObject *element; if (iterator == NULL) { /* propaguj błąd */ } while (element = PyIter_Next(iterator)) { /* zrób coś z elementem */ ... /* zwolnij odniesienie gdy skończysz */ Py_DECREF(element); } Py_DECREF(iterator); if (PyErr_Occurred()) { /* propaguj błąd */ } else { /* dalej rób coś porzytecznego */ }

source: Iterator Objects
pl: Przedmioty Iterujące
